app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "post", "updated_at", "user") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", nil], ["created_at", Thu, 31 Oct 2013 14:14:21 UTC +00:00], ["post", nil], ["updated_at", Thu, 31 Oct 2013 14:14:21 UTC +00:00], ["user", "derevjaginti"]]
UPDATE "comments" SET "user" = 'derevjaginti', "post" = '3', "updated_at" = '2013-10-31 14:49:40.094354' WHERE "comments"."id" = 20
---
	def create
    @comment = Comment.create(params[:comment])

    current_user ? @comment.user = current_user.username : @comment.user = "Anonymous"

    respond_to do |format|
      if @comment.save