app/controllers/posts_controller.rb

  def show_user
    @posts = Post.where(user: current_user.username)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user" = 'derevjaginti'

  def show
    @post = Post.find(params[:id])
    @comments = Comment.where(post: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post" = '1'

  def create
    @post = Post.new(params[:post])
    @post.user = current_user.username

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at", "user") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "work pretty\r\n"], ["created_at", Tue, 29 Oct 2013 20:09:22 UTC +00:00], ["title", "test"], ["updated_at", Tue, 29 Oct 2013 20:09:22 UTC +00:00], ["user", nil]]

  def update
    @post = Post.find(params[:id])

    if @post.user!=current_user.username
      return redirect_to '/'
    end

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "updated_at" = '2013-11-01 07:36:21.785931' WHERE "posts"."id" = 7

  def destroy
    @post = Post.find(params[:id])

    if @post.user!=current_user.username
      return redirect_to '/'
    end

    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]