app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = 'name'
---
  def index
    if params[:tag].present?
      @posts = Post.tagged_with(params[:tag])
    elsif params[:username].present?
      user = User.where(name: params[:username])